app/controllers/decrypt_messages_controller.rb

SELECT  "rsas".* FROM "rsas" WHERE "rsas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_rsa
    @rsa = Rsa.find params[:rsa_id]