app/controllers/encrypt_messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "updated_at", "rsa_id") VALUES (?, ?, ?, ?)
---
  def create
    key = OpenSSL::PKey::RSA.new 2048
    set_ned(key)
    encrypted = key.public_encrypt(params[:message])
    encoded = Base64.strict_encode64(encrypted)
    @message = @rsa.messages.create(content: encoded)

SELECT  "rsas".* FROM "rsas" WHERE "rsas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_rsa
    @rsa = Rsa.find params[:rsa_id]

SELECT  "messages".* FROM "messages" WHERE "messages"."rsa_id" = ? AND "messages"."id" = ? LIMIT ?  [["rsa_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_message
    @message = @rsa.messages.find params[:id]