app/controllers/rsas_controller.rb

INSERT INTO "rsas" ("n", "e", "d", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    key = OpenSSL::PKey::RSA.new 2048
    if params[:n] && params[:e] && params[:d] then set_ned key end
    @rsa = Rsa.create(n: key.params["n"], e: key.params["e"], d: key.params["d"])

SELECT  "rsas".* FROM "rsas" WHERE "rsas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_rsa
    @rsa = Rsa.find_by(id: params[:id])